In [248]:
import pandas as pd
import numpy as np
from dateutil.parser import parse
from collections import Counter
import re #regex
from scipy.signal import find_peaks
import datetime
import os

# 1. How to import pandas and check the version?

In [2]:
pd.__version__

'1.0.3'

# 2. How to create a series from a list, numpy array and dict?

In [7]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

out = pd.Series(mydict)
out.head()

a    0
b    1
c    2
e    3
d    4
dtype: int64

# 3. How to convert the index of a series into a column of a dataframe?

In [12]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

out = pd.DataFrame(ser).reset_index()
out.head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

# 4. How to combine many series to form a dataframe?

In [15]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

out = pd.concat([ser1,ser2]).reset_index() # or pd.concat([ser1,ser2],index=1)
out.head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  e
4      4  d

# 5. How to assign name to the seriesâ€™ index?

In [17]:
#input 
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

out = pd.Series(list('abcedfghijklmnopqrstuvwxyz'),index=np.arange(0,26),name='alphabet')
out

#Answer from the website 
# using series rename method
ser.rename("alphabets")
# using series attribute
ser.name = "other_name"

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: alphabet, dtype: object

# 6. How to get the items of series A not present in series B?

In [33]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

out = pd.Series(np.setdiff1d(ser1,ser2))

#Answer from the Website
out = ser1[~ser1.isin(ser2)]
out

0    1
1    2
2    3
dtype: int64

# 7. How to get the items not common to both series A and series B?

In [262]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

out = list(set(ser1).symmetric_difference(ser2))
out_pureNumpy = np.setdiff1d(np.union1d(ser1,ser2),np.intersect1d(ser1,ser2))

array([1, 2, 3, 6, 7, 8])

# 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [48]:
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

out = ser.describe()
out

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

# 9. How to get frequency counts of unique items of a series?

In [59]:
# input
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

out = ser.value_counts()
out

d    6
h    5
f    5
g    4
e    3
a    3
b    2
c    2
dtype: int64

# 10. How to keep only top 2 most frequent values as it is and replace everything else as â€˜Otherâ€™?

In [243]:
# input
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
index_freq = ser.value_counts().index[:2]
ser[index_freq] = 'Other'
ser

0         1
1     Other
2         1
3         1
4     Other
5         4
6         3
7         1
8         2
9         2
10        1
11        4
dtype: object

# 11. How to bin a numeric series to 10 groups of equal size?

In [9]:
ser = pd.Series(np.random.random(20))
out = pd.qcut(ser,10)
out

0     (0.429, 0.504]
1     (0.122, 0.183]
2       (0.63, 0.76]
3      (0.76, 0.815]
4     (0.122, 0.183]
5     (0.815, 0.919]
6     (0.429, 0.504]
7      (0.586, 0.63]
8       (0.63, 0.76]
9     (0.504, 0.586]
10    (0.919, 0.956]
11    (0.236, 0.429]
12    (0.183, 0.236]
13    (0.504, 0.586]
14    (0.815, 0.919]
15     (0.76, 0.815]
16     (0.586, 0.63]
17    (0.236, 0.429]
18    (0.183, 0.236]
19    (0.919, 0.956]
dtype: category
Categories (10, interval[float64]): [(0.122, 0.183] < (0.183, 0.236] < (0.236, 0.429] < (0.429, 0.504] ... (0.63, 0.76] < (0.76, 0.815] < (0.815, 0.919] < (0.919, 0.956]]

# 12. How to convert a numpy array to a dataframe of given shape? (L1)
Reshape the series ser into a dataframe with 7 rows and 5 columns

In [20]:
ser = pd.Series(np.random.randint(1, 10, 35))
out = pd.DataFrame(np.resize(ser,(7,5)))
out

   0  1  2  3  4
0  1  6  6  2  8
1  7  1  3  5  1
2  3  6  7  3  2
3  5  7  5  5  2
4  5  6  3  8  5
5  3  7  3  1  5
6  3  4  8  6  6

# 13. How to find the positions of numbers that are multiples of 3 from a series?

Find the positions of numbers that are multiples of 3 from ser.

In [26]:
# input
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, 10))
out = ser[ser % 3 == 0]
out

1    3
2    3
3    3
4    3
9    3
dtype: int64

# 14. How to extract items at given positions from a series

From ser, extract the items at positions in list pos.

In [30]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
out = ser.take(pos)
out

0     a
4     e
8     i
14    o
20    u
dtype: object

# 15. How to stack two series vertically and horizontally ?

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [35]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
out = pd.concat([ser1,ser2], axis=1)
out

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

# 16. How to get the positions of items of series A in another series B?

Get the positions of items of ser2 in ser1 as a list.

In [80]:
# input
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

pass

# 17. How to compute the mean squared error on a truth and predicted series?

Compute the mean squared error of truth and pred series.

In [84]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

outt = np.mean((truth-pred)**2)

0.3399201246072864

# 18. How to convert the first character of each element in a series to uppercase?

Change the first character of each word to upper case in each word of ser.

In [97]:
ser = pd.Series(['just', 'a', 'random', 'list'])

out = ser.str.capitalize()
out

0      Just
1         A
2    Random
3      List
dtype: object

# 19. How to calculate the number of characters in each word in a series?

In [108]:
ser = pd.Series(['just', 'a', 'random', 'list'])

out1 = [len(x) for x in ser]

out2 = ser.apply(len)

out3 = ser.map(len)

0    4
1    1
2    6
3    4
dtype: int64

# 20. How to compute difference of differences between consequtive numbers of a series?

Difference of differences between the consequtive numbers of ser.

In [114]:
# input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

out = ser.diff().tolist()
out2 = ser.diff().diff().tolist()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

# 21. How to convert a series of date-strings to a timeseries?

In [116]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

out = pd.to_datetime(ser)
out

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

# 22. How to get the day of month, week number, day of year and day of week from a series of date strings?

Get the day of month, week number, day of year and day of week from ser.

In [139]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
parsee = ser.map(lambda x:parse(x))

day = parsee.dt.day.tolist()
week_num = parsee.dt.week.tolist()
day_ofYear = parsee.dt.dayofyear.tolist()
day_ofWeek = parsee.dt.day_name().tolist()

[1, 2, 3, 4, 5, 6]
[53, 5, 9, 14, 19, 23]
[1, 33, 63, 94, 125, 157]
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

# 23. How to convert year-month string to dates corresponding to the 4th day of the month?

Change ser to dates that start with 4th of the respective months.

In [234]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
out = ser.map(lambda x:parse(x))
out

0   2010-01-05
1   2011-02-05
2   2012-03-05
dtype: datetime64[ns]

# 24. How to filter words that contain atleast 2 vowels from a series?

From ser, extract words that contain atleast 2 vowels.

In [168]:
import re
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

out = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[out]

0     Apple
1    Orange
4     Money
dtype: object

# 25. How to filter valid emails from a series?
Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

In [5]:

emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

out = emails[emails.str.contains(pattern,flags=re.I,regex = True)]
out

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

# 26. How to get the mean of a series grouped by another series?

In [25]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
conc = pd.concat([fruit,weights],axis=1,keys=['Fruits','Weights'])

out = conc.groupby('Fruits').mean()
out

         Weights
Fruits
apple   5.600000
banana  6.333333
carrot  4.000000

# 27. How to compute the euclidean distance between two series?
Compute the euclidean distance between series (points) p and q, without using a packaged formula.

In [28]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

form = np.sqrt(sum([(p-q)**2 for p,q in zip(p,q)]))
form

18.16590212458495

# 28. How to find all the local maxima (or peaks) in a numeric series?

In [34]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])
out1 = np.diff(np.sign(np.diff(ser)))
out2 = find_peaks(ser)

[-2  2  0  0 -2  2 -2]
(array([1, 5, 7]), {})

# 29. How to replace missing spaces in a string with the least frequent character?
Replace the spaces in my_str with the least frequent character.

In [37]:
my_str = 'dbc deb abed ggade'

out = np.char.replace(my_str,' ','c')
out

array('dbccdebcabedcggade', dtype='<U18')

# 30. How to create a TimeSeries starting â€˜2000-01-01â€™ and 10 weekends (saturdays) after that having random numbers as values?

In [55]:
number = pd.Series(np.random.randint(1,10,size=10))
week = pd.Series(pd.date_range(start='2000-01-01',periods=10,freq=pd.offsets.Day(7)))
conc = pd.concat([week,number],axis=1,keys=['Time','Numbers'])
conc

        Time  Numbers
0 2000-01-01        2
1 2000-01-08        9
2 2000-01-15        4
3 2000-01-22        3
4 2000-01-29        5
5 2000-02-05        1
6 2000-02-12        8
7 2000-02-19        1
8 2000-02-26        9
9 2000-03-04        5

# 31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?
ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

In [86]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
out = pd.Series(ser.values.repeat(2),index = pd.period_range(ser.index[0],periods=8))
out

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

# 32. How to compute the autocorrelations of a numeric series?

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

In [93]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

out = ser.autocorr(lag=10)
out

0.07291076640059191

# 33. How to import only every nth row from a csv file to create a dataframe?
Import every 50th row of BostonHousing dataset as a dataframe.

In [70]:
df = pd.read_csv("housing_prep.csv",chunksize = 50)
df2 = pd.concat([chunk.iloc[0] for chunk in df],axis=1)
df3 = df2.transpose()

df3

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
50,50.0,0.08873,21.0,5.64,0.0,0.439,5.963,45.7,6.8147,4.0,243.0,16.8,395.56,13.45,19.7
100,100.0,0.14866,0.0,8.56,0.0,0.520,6.727,79.9,2.7778,5.0,384.0,20.9,394.76,9.42,27.5
150,150.0,1.65660,0.0,19.58,0.0,0.871,6.122,97.3,1.6180,5.0,403.0,14.7,372.80,14.10,21.5
200,200.0,0.01778,95.0,1.47,0.0,0.403,7.135,13.9,7.6534,3.0,402.0,17.0,384.30,4.45,32.9
250,250.0,0.14030,22.0,5.86,0.0,0.431,6.487,13.0,7.3967,7.0,330.0,19.1,396.28,5.90,24.4
300,300.0,0.04417,70.0,2.24,0.0,0.400,6.871,47.4,7.8278,5.0,358.0,14.8,390.86,6.07,24.8
350,350.0,0.06211,40.0,1.25,0.0,0.429,6.490,44.4,8.7921,1.0,335.0,19.7,396.90,5.98,22.9
400,400.0,25.04610,0.0,18.10,0.0,0.693,5.987,100.0,1.5888,24.0,666.0,20.2,396.90,26.77,5.6
450,450.0,6.71772,0.0,18.10,0.0,0.713,6.749,92.6,2.3236,24.0,666.0,20.2,0.32,17.44,13.4
500,500.0,0.22438,0.0,9.69,0.0,0.585,6.027,79.7,2.4982,6.0,391.0,19.2,396.90,14.33,16.8

# 34. How to change column values when importing csv to a dataframe?
Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes â€˜Lowâ€™ and > 25 becomes â€˜Highâ€™.

In [66]:
df = pd.read_csv("housing_prep.csv")
df.MEDV = np.where(df.MEDV < 25, 'LOW','HIGH')
df

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,LOW
1,1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,LOW
2,2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,HIGH
3,3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,HIGH
4,4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,HIGH
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
502,502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,LOW
503,503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,LOW
504,504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,LOW
505,505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,LOW
506,506,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,HIGH

# 35. How to create a dataframe with rows as strides from a given series?

In [31]:
L = pd.Series(range(15))
index = np.arange(0,15,2)
out = np.array([L[index[i]:index[i+2]] for i in range(6)])

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]])

# 36. How to import only specified columns from a csv file?

In [51]:
df = pd.read_csv('housing_prep.csv')
out = df[['CRIM','ZN','CHAS']].head()
out

      CRIM    ZN  CHAS
0  0.00632  18.0   0.0
1  0.02731   0.0   0.0
2  0.02729   0.0   0.0
3  0.03237   0.0   0.0
4  0.06905   0.0   0.0

# 37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

In [65]:
df = pd.read_csv('housing_prep.csv')
nrows = df.shape
datatype = df.dtypes.value_counts()
sumStats = df.describe()
ncols = df.columns
info = df.info

Nrows =  (507, 15)
DataType =  float64    14
int64       1
dtype: int64
Summary Stats =         Unnamed: 0        CRIM          ZN       INDUS        CHAS         NOX  \
count   507.00000  506.000000  506.000000  506.000000  506.000000  506.000000
mean    253.00000    3.613524   11.363636   11.136779    0.069170    0.554695
std     146.50256    8.601545   23.322453    6.860353    0.253994    0.115878
min       0.00000    0.006320    0.000000    0.460000    0.000000    0.385000
25%     126.50000    0.082045    0.000000    5.190000    0.000000    0.449000
50%     253.00000    0.256510    0.000000    9.690000    0.000000    0.538000
75%     379.50000    3.677082   12.500000   18.100000    0.000000    0.624000
max     506.00000   88.976200  100.000000   27.740000    1.000000    0.871000

               RM         AGE         DIS         RAD         TAX     PTRATIO  \
count  506.000000  506.000000  506.000000  506.000000  506.000000  506.000000
mean     6.284634   68.574901    3.795043    9.549407  408.237154   18.455534
std      0.702617   28.148861    2.105710    8.707259  168.537116    2.164946
min      3.561000    2.900000    1.129600    1.000000  187.000000   12.600000
25%      5.885500   45.025000    2.100175    4.000000  279.000000   17.400000
50%      6.208500   77.500000    3.207450    5.000000  330.000000   19.050000
75%      6.623500   94.075000    5.188425   24.000000  666.000000   20.200000
max      8.780000  100.000000   12.126500   24.000000  711.000000   22.000000

                B       LSTAT        MEDV
count  506.000000  506.000000  506.000000
mean   356.674032   12.653063   22.532806
std     91.294864    7.141062    9.197104
min      0.320000    1.730000    5.000000
25%    375.377500    6.950000   17.025000
50%    391.440000   11.360000   21.200000
75%    396.225000   16.955000   25.000000
max    396.900000   37.970000   50.000000
Ncols =  Index(['Unnamed: 0', 'CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS',
       'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV'],
      dtype='object')
Info =  <bound method DataFrame.info of      Unnamed: 0     CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD  \
0             0  0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900  1.0
1             1  0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671  2.0
2             2  0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671  2.0
3             3  0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622  3.0
4             4  0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622  3.0
..          ...      ...   ...    ...   ...    ...    ...   ...     ...  ...
502         502  0.04527   0.0  11.93   0.0  0.573  6.120  76.7  2.2875  1.0
503         503  0.06076   0.0  11.93   0.0  0.573  6.976  91.0  2.1675  1.0
504         504  0.10959   0.0  11.93   0.0  0.573  6.794  89.3  2.3889  1.0
505         505  0.04741   0.0  11.93   0.0  0.573  6.030  80.8  2.5050  1.0
506         506      NaN   NaN    NaN   NaN    NaN    NaN   NaN     NaN  NaN

       TAX  PTRATIO       B  LSTAT  MEDV
0    296.0     15.3  396.90   4.98  24.0
1    242.0     17.8  396.90   9.14  21.6
2    242.0     17.8  392.83   4.03  34.7
3    222.0     18.7  394.63   2.94  33.4
4    222.0     18.7  396.90   5.33  36.2
..     ...      ...     ...    ...   ...
502  273.0     21.0  396.90   9.08  20.6
503  273.0     21.0  396.90   5.64  23.9
504  273.0     21.0  393.45   6.48  22.0
505  273.0     21.0  396.90   7.88  11.9
506    NaN      NaN     NaN    NaN   NaN

[507 rows x 15 columns]>

# 38. How to extract the row and column number of a particular cell with given criterion?

In [74]:
df = pd.read_csv('housing_prep.csv')

out = df.loc[df['TAX'] == df.TAX.max()]
out2 = out[['CRIM','ZN','TAX']]
out2

        CRIM   ZN    TAX
488  0.15086  0.0  711.0
489  0.18337  0.0  711.0
490  0.20746  0.0  711.0
491  0.10574  0.0  711.0
492  0.11132  0.0  711.0

# 39. How to rename a specific columns in a dataframe?

In [88]:
df = pd.read_csv('Cars93.csv')
out = df.rename(columns={
                        'Type':'CarType',
                        'Min.Price':'Min_Price',
                        'Max.Price':'Max_Price',
                        'MPG.city':'MPG_city',
                        'MPG.highway':'MPG_highway',
                        'Rev.per.mile':'Rev_per_mile',
                        'Man.trans.avail':'Man_trans_avail',
                        'Fuel.tank.capacity':'Fuel_tank_capacity',
                        'Turn.circle':'Turn_circle',
                        'Rear.seat.room':'Rear_seat_room',
                        'Luggage.room':'Luggage_room'}).head()
out

,Unnamed: 0,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

# 40. How to check if a dataframe has any missing values?

In [121]:
df = pd.read_csv('Cars93.csv')
out = df.isnull().sum().sum()
out

13

# 41. How to count the number of missing values in each column?
Count the number of missing values in each column of df. Which column has the maximum number of missing values?

In [24]:
df = pd.read_csv('Cars93.csv')
out = df.apply(lambda x:x.isnull().sum())
out.idxmax()

'Luggage.room'

# 42. How to replace missing values of multiple numeric columns with the mean?

Replace missing values in Luggage.room columns with their respective mean.

In [34]:
df = pd.read_csv('Cars93.csv')
df.loc[df['Luggage.room'].isnull(),'Luggage.room'] = df['Luggage.room'].mean()

0     11.000000
1     15.000000
2     14.000000
3     17.000000
4     13.000000
        ...
88    13.890244
89    14.000000
90    15.000000
91    14.000000
92    15.000000
Name: Luggage.room, Length: 93, dtype: float64

# 43. How to use apply function on existing columns with global variables as additional arguments?
In df, use apply method to replace the missing values in Rear.seat.room with mean Luggage.room with median by passing an argument to the function.

In [54]:
df = pd.read_csv('Cars93.csv')

print("We have a total of {} nulls".format(df.isnull().sum().sum()))

def num_inputer(x, strategy):
    if strategy.lower() == "mean":
        x = x.fillna(np.nanmean(x))
    if strategy.lower() == "median":
        x = x.fillna(np.nanmedian(x))
    return x

df['Rear.seat.room'] = df[['Rear.seat.room']].apply(num_inputer, args = ["mean"])
df['Luggage.room'] = df[['Luggage.room']].apply(num_inputer,args=['median'])

print("We have a total of {} nulls".format(df.isnull().sum().sum()))

df['Luggage.room'].sum()
df['Rear.seat.room'].sum()

We have a total of 13 nulls
We have a total of 0 nulls

2588.1593406593406

# 44. How to select a specific column from a dataframe as a dataframe instead of a series?
Get the first column (a) in df as a dataframe (rather than as a Series).

In [67]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
out = df.iloc[:,0].to_frame()
out

    a
0   0
1   5
2  10
3  15

# 45. How to change the order of columns of a dataframe?
Actually 3 questions.

   1. In df, interchange columns 'a' and 'c'.

   2.  Create a generic function to interchange two columns, without hardcoding column names.

   3. Sort the columns in reverse alphabetical order, that is colume 'e' first through column 'a' last.

In [101]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

#1
columns_title = ['c','b','a','d','e']
inter_change = df.reindex(columns=columns_title)

#2
def change_cols(df,col1,col2):
    df_columns = df.columns.to_list()
    index1 = df_columns.index(col1)
    index2 = df_columns.index(col2)
    df_columns[index1],df_columns[index2] = col2, col1
    
    return df[df_columns]

out = change_cols(df,'a','c')

#3
sort = df.sort_index(axis=1,ascending=False)

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

# 46. How to set the number of rows and columns displayed in the output?

Change the pandas display settings on printing the dataframe df it shows a maximum of 10 rows and 10 columns.

In [111]:
cols = pd.read_csv('Cars93.csv').columns
df = pd.read_csv('Cars93.csv',nrows=10,usecols=cols[:10])
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only
5,6,Buick,Century,Midsize,14.2,15.7,17.3,22,31,Driver only
6,7,Buick,LeSabre,Large,19.9,20.8,21.7,19,28,Driver only
7,8,Buick,Roadmaster,Large,22.6,23.7,24.9,16,25,Driver only
8,9,Buick,Riviera,Midsize,26.3,26.3,26.3,19,27,Driver only
9,10,Cadillac,DeVille,Large,33.0,34.7,36.3,16,25,Driver only

# 47. How to format or suppress scientific notations in a pandas dataframe?
Suppress scientific notations like â€˜e-03â€™ in df and print upto 4 numbers after decimal.

In [123]:
df = pd.DataFrame(np.random.random(5)**10, columns=['random'])
out = df.round(5)
out

    random
0  0.04030
1  0.00160
2  0.00041
3  0.00002
4  0.00008

# 48. How to format all the values in a dataframe as percentages?
Format the values in column 'random' of df as percentages.

In [142]:
df = pd.DataFrame(np.random.random(4), columns=['random'])

def percentages(df):
    percentage = str(round(df * 100,2))+'%'
    return percentage

df.random = df.random.apply(percentages)
df

   random
0  68.24%
1  46.16%
2  61.28%
3   6.97%

# 49. How to filter every nth row in a dataframe?
From df, filter the 'Manufacturer', 'Model' and 'Type' for every 20th row starting from 1st (row 0).

In [168]:
df = pd.read_csv('Cars93.csv',chunksize=20)
one = pd.concat([chunk.iloc[0] for chunk in df],axis=1)
two = one.transpose()
out = two.filter(items=['Manufacturer','Model','Type'])

# another way
df2 = pd.read_csv('Cars93.csv',usecols=['Manufacturer','Model','Type'])
out = df2[::20]
out3 = df2.iloc[::20,:][['Manufacturer','Model','Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

# 50. How to create a primary key index by combining relevant columns?
In df, Replace NaNs with â€˜missingâ€™ in columns 'Manufacturer', 'Model' and 'Type' and create a index as a combination of these three columns and check if the index is a primary key.

In [230]:
df = pd.read_csv('Cars93.csv',usecols=["Manufacturer", "Model", "Type", "Min.Price", "Max.Price"])

df.fillna(value='Missing')
df['new_index'] = df.Manufacturer+df.Model+df.Type
df.set_index('new_index',inplace=True)
df

                        Manufacturer    Model     Type  Min.Price  Max.Price
new_index
AcuraIntegraSmall              Acura  Integra    Small       12.9       18.8
AcuraLegendMidsize             Acura   Legend  Midsize       29.2       38.7
Audi90Compact                   Audi       90  Compact       25.9       32.3
Audi100Midsize                  Audi      100  Midsize       30.8       44.6
BMW535iMidsize                   BMW     535i  Midsize       23.7       36.2
...                              ...      ...      ...        ...        ...
VolkswagenEurovanVan      Volkswagen  Eurovan      Van       16.6       22.7
VolkswagenPassatCompact   Volkswagen   Passat  Compact       17.6       22.4
VolkswagenCorradoSporty   Volkswagen  Corrado   Sporty       22.9       23.7
Volvo240Compact                Volvo      240  Compact       21.8       23.5
Volvo850Midsize                Volvo      850  Midsize       24.8       28.5

[93 rows x 5 columns]

# 51. How to get the row number of the nth largest value in a column?
Find the row position of the 5th largest value of column 'a' in df.

In [77]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
df.index = df.a.argsort().argsort()
df['arg_sort'] = df.index
df

    a   b   c  arg_sort
a
0   6   4  16         0
6  18  28   7         6
3  11   7  10         3
2   9  15  14         2
9  29   9   7         9
4  14  29  21         4
5  16  27  24         5
7  20  10  20         7
1   8  29   1         1
8  28   9  11         8

# 52. How to find the position of the nth largest value greater than a given value?
In ser, find the position of the 2nd largest value greater than the mean.

In [121]:
ser = pd.Series(np.random.randint(1, 100, 15))
meann = ser.mean()
out = ser.nlargest(n=2).index[1]
print(list(ser))
print('mean :', meann)
print('index :',out)

[80, 23, 81, 18, 52, 23, 3, 56, 80, 79, 55, 37, 61, 33, 34]
mean : 47.666666666666664
index : 0

# 53. How to get the last n rows of a dataframe with row sum > 100?

Get the last two rows of df whose row sum is greater than 100.

In [239]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df1 = df.copy(deep = True)
df1['sum'] = df1.sum(axis=1)
outt = df1.sort_values(by='sum',ascending=False).head(2)
outt

    0   1   2   3  sum
9  39  33  24  39  135
6  37  31  39  24  131

# 54. How to find and cap outliers from a series or dataframe column?
Replace all values of ser in the lower 5%ile and greater than 95%ile with respective 5th and 95th %ile value.

In [249]:
ser = pd.Series(np.logspace(-2, 2, 30))
print('0.05 %ile: {} | 0.95 %ile: {}'.
      format(ser.quantile(0.05),ser.quantile(0.95)))

0.05 %ile: 0.016049294076965887 | 0.95 %ile: 63.876672220183934

# 55. How to reshape a dataframe to the largest possible square after removing the negative values?
Reshape df to the largest possible square with negative values removed. Drop the smallest values if need be. The order of the positive numbers in the result should remain the same as the original.

In [231]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
# Solution from the webpage
# Step 1: remove negative values from arr
arr = df[df > 0].values.flatten()
arr_qualified = arr[~np.isnan(arr)]

# Step 2: find side-length of largest possible square
n = int(np.floor(arr_qualified.shape[0]**.5))

# Step 3: Take top n^2 items without changing positions
top_indexes = np.argsort(arr_qualified)[::-1]
output = np.take(arr_qualified, sorted(top_indexes[:n**2])).reshape(n, -1)
output

array([[14., 46., 44., 33., 12., 19., 37.],
       [42., 20., 25., 10., 14., 38., 22.],
       [48., 24., 24., 43., 10., 18., 41.],
       [24., 28., 43., 11., 11., 27., 20.],
       [41., 27., 19., 29., 45., 14., 45.],
       [12., 40., 31., 46., 44., 39., 10.],
       [40., 41., 41., 20., 23., 47., 13.]])

# 57. How to reverse the rows of a dataframe?
Reverse all the rows of dataframe df.

In [7]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
out = df[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

# 58. How to create one-hot encodings of a categorical variable (dummy variables)?
Get one-hot encodings for column 'a' in the dataframe df and append it as columns.

In [52]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
dummy = pd.get_dummies(df["a"])
out = pd.concat((dummy,df),axis=1)
out

   0  5  10  15  20   a   b   c   d   e
0  1  0   0   0   0   0   1   2   3   4
1  0  1   0   0   0   5   6   7   8   9
2  0  0   1   0   0  10  11  12  13  14
3  0  0   0   1   0  15  16  17  18  19
4  0  0   0   0   1  20  21  22  23  24

# 59. Which column contains the highest number of row-wise maximum values?
row-wise maximumâ€™s in df.

In [70]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df['col_index_with_max'] = df.idxmax(axis=1)
df

    0   1   2   3  col_index_with_max
0  49  33  37  56                   3
1  80  87  19  95                   3
2  98  42  29  17                   0
3  14  26  34  82                   3
4  73  73  65  37                   0
5  63  87  67   2                   1
6  39  94  78  68                   1
7  51  82  51  57                   1
8  45  38  52  42                   2
9   5  36  94   3                   2

# 60. How to create a new column that contains the row number of nearest column by euclidean distance?

In [89]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))
distance_for = round(np.sqrt((df.p-df.q)**2 + (df.r-df.s)**2),2)
df['dist'] = distance_for
df

    p   q   r   s   dist
a  42  51  95  16  79.51
b  89  50  37  49  40.80
c  51  71  92  84  21.54
d  58  75  76  50  31.06
e  74  48  93  59  42.80
f  84  22  54  79  66.85
g  28   2  40  36  26.31
h  82  67  64  47  22.67
i  46  37  94  71  24.70
j  16  94  63  18  90.05

# 61. How to know the maximum possible correlation value of each column against other columns?
For each column get the maximum possible correlation with other columns (only 1 value)

In [150]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))
corr = np.abs(df.corr())
max_corr = corr.apply(lambda x: sorted(x)[-2])
max_corr

p    0.471314
q    0.836603
r    0.810751
s    0.571478
t    0.432586
u    0.666606
v    0.810751
w    0.836603
x    0.574635
y    0.768950
dtype: float64

# 62. How to create a column containing the minimum by maximum of each row?
Compute the minimum-by-maximum for every row of df.

In [170]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df['min_by_max'] = (np.min(df,axis=1)/np.max(df,axis=1)) 
df

    0   1   2   3   4   5   6   7   8   9  min_by_max
0  14  38  67  53  95  53  15  82  14  94    0.147368
1  80  14  65  63  43   6   8   4  75  95    0.042105
2  88  10   6  63  53  82  57  71  67  48    0.068182
3  43  64  86  25  99  88   3  57  53  20    0.030303
4  63  47  56  71   8  68  72  26  20  55    0.111111
5   1  51  40  60  20  21  43  12  87  34    0.011494
6  91  43  70  64  55  70  97  70  36  12    0.123711
7  63  11  48  75   8  63  47  18  17  49    0.106667

# 63. How to create a column that contains the penultimate value in each row?
Create a new column 'penultimate' which has the second largest value of each row of df.

In [2]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df['penultimate'] = df.apply(lambda x:x.sort_values().unique()[-2],axis=1)
df

    0   1   2   3   4   5   6   7   8   9  penultimate
0   8  59  64  99  29  37  14   1  12  65           65
1  22  14  24   3   3  23  19  74  17  76           74
2  54  63  78   2  26  84   8   4   5  98           84
3  17  44  38  49  14  13  41  33  33   8           44
4  95  83  38  32  20  27  88  47  71  39           88
5  19  99  17  61  66  96   7  77  23  78           96
6  27  86  74  85  53  96  98  62   9  49           96
7  84  61  22  31  47  98  48  41  73  52           84

# 64. How to normalize all columns in a dataframe?

 a. Normalize all columns of df by subtracting the column mean and divide by standard deviation.

 b. Range all columns of df such that the minimum value in each column is 0 and max is 1.

In [66]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df1 = df.copy()
out_a = (df - df.mean())/df.std()
out_b = df1.apply(lambda x:((x.max()-x)/(x.max()-x.min())).round(2))

      0     1     2     3     4     5     6     7     8     9
0  0.89  0.82  0.64  0.32  1.00  0.77  0.92  0.88  0.14  1.00
1  0.96  0.21  0.45  0.59  0.15  0.92  0.05  0.00  0.42  0.55
2  1.00  1.00  0.00  0.72  0.93  0.33  0.24  0.76  0.46  0.10
3  0.77  1.00  0.65  0.61  0.21  0.00  0.06  0.88  1.00  0.88
4  0.19  0.51  1.00  0.00  0.21  0.00  0.85  0.81  0.36  0.29
5  0.58  0.09  0.85  0.95  0.00  1.00  0.73  0.37  0.00  0.00
6  0.00  0.12  0.65  1.00  0.56  0.73  1.00  1.00  0.68  0.79
7  0.43  0.00  0.53  0.14  0.38  0.73  0.00  0.33  0.08  0.36

# 65. How to compute the correlation of each row with the suceeding row?
Compute the correlation of each row of df with its succeeding row.

In [86]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df['corr_'] = df.corrwith(df.iloc[0],axis=0)
df

    0   1   2   3   4   5   6   7   8   9     corr_
0  27  57  26  10  96  76  55  78  47  86 -0.404993
1  52  57  47  85  10  45   6  41   5  96  0.786367
2  98  64  44  44  57   2  23  97  45  73 -0.199888
3  45  13  81  48  84  27   1  65  24  24  0.295137
4  43  98  41  44  19  35  18  66  96   4 -0.774742
5  35  54  15  76  37  99  89  47  10  70  0.325033
6  46  61  65  77  75  27  33  28   3  73  0.379159
7   6  90  79  39  19  52  68  42   6  77 -0.486157

# 66. How to replace both the diagonals of dataframe with 0?
Replace both values in both diagonals of df with 0.

In [230]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
out = df.where(df.values != np.diag(df),0,df.where(df.values != np.flipud(df).diagonal(0),0,inplace=True))
out

    0   1   2   3   4   5   6   7   8   9
0   0  11   7  89   8  89  90  78   7   0
1   3   0  49  83  82  84  77   4   0  18
2  94  54   0  90  87  97  38   0  65   2
3   8  21  44   0  82   8   0  24  27   8
4  84  64  25  67   0   0  66  45  37   9
5  70  87   3  60   0   0  89  91  12  76
6  60  43  73   0  26  45   0  64   0  47
7   1   1   0  61  26  14  13   0  69  69
8  40   0  73   8  12  73  21  71   0  67
9   0  62  85  71  48  23  30  86  18   0

# 67. How to get the particular group of a groupby dataframe by key?
This is a question related to understanding of grouped dataframe. From df_grouped, get the group belonging to 'apple' as a dataframe.

In [2]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])
out =  df_grouped.get_group('apple')
out

    col1      col2  col3
0  apple  0.865893     5
3  apple  0.233558     5
6  apple  0.836302     3

# 68. How to get the nâ€™th largest value of a column when grouped by another column?

In df, find the second largest value of 'rating' for 'banana'

In [18]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df_grouped = df.groupby('fruit')
out = df_grouped.get_group('banana')
out.select_dtypes(include=float)

     rating
1  0.400492
4  0.663281
7  0.255926

# 69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?
In df, Compute the mean price of every fruit, while keeping the fruit as another column instead of an index.

In [37]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df_grouped = df.groupby(['fruit'])['price'].mean()
df_grouped

fruit
apple     8.333333
banana    3.666667
orange    7.333333
Name: price, dtype: float64

# 70. How to join two dataframes by 2 columns so they have only the common rows?
Join dataframes df1 and df2 by â€˜fruit-pazhamâ€™ and â€˜weight-kiloâ€™.

In [47]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})
out = df1.merge(df2,left_on=('fruit','weight'),right_on=('pazham','kilo'),how='inner',suffixes=('_left','_right')).head(10)

    fruit weight  price_left  pazham  kilo  price_right
0   apple   high          14   apple  high            9
1   apple   high           5   apple  high            9
2   apple   high           4   apple  high            9
3  orange    low           4  orange   low           14
4  orange    low          11  orange   low           14
5  orange    low           3  orange   low           14

# 71. How to remove rows from a dataframe that are present in another dataframe?


From df1, remove the rows that are present in df2. All three columns must be the same.

In [84]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 10, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 10, 6)})

out = df1.loc[~((df1.fruit.isin(df2.pazham))&(df1.price.isin(df2['price']))),:]
out

    fruit  weight  price
1  banana  medium      0
2  orange     low      3
3   apple    high      1
4  banana  medium      0
5  orange     low      8
7  banana  medium      2

# 72. How to get the positions where values of two columns match?

Find the index where col fruit1 and fruit2 match

In [151]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})
out = df.index[df.fruit1 == df.fruit2].tolist()
out

[2, 6, 7, 8]

# 73. How to create lags and leads of a column in a dataframe?

Create two new columns in df, one of which is a lag1 (shift column a down by 1 row) of column â€˜aâ€™ and the other is a lead1 (shift column b up by 1 row).

In [175]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))
df['lag1'] = df.a.shift(1)
df['lead1'] = df.b.shift(-1)
df

    a   b   c   d  lag1  lead1
0  62   9  65  83   NaN   49.0
1  15  49  96  28  62.0   50.0
2  24  50   7  34  15.0   12.0
3  61  12  25  33  24.0    3.0
4  16   3  55  89  61.0    NaN

# 74. How to get the frequency of unique values in the entire dataframe?

Get the frequency of unique values in the entire dataframe df.

In [187]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))
out = df.stack().value_counts()
out

4    4
2    4
5    3
9    2
7    2
6    2
1    2
3    1
dtype: int64

# 75. How to split a text column into two separate columns?

Split the string column in df to form a dataframe with 3 columns as shown.

In [229]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

out = pd.DataFrame(df.row.str.split(' ',2).tolist(),columns=['STD','City','State'])
out.drop(index=0,inplace=True)
out

   STD       City           State
1  33,    Kolkata     West Bengal
2  44,    Chennai      Tamil Nadu
3  40,  Hyderabad       Telengana
4  80,  Bangalore       Karnataka